[{"title": "Web crawler - Wikipedia", "text": "\n\n\n\nWeb crawler - Wikipedia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJump to content\n\n\n\n\n\n\n\n\nMain menu\n\n\n\n\n\nMain menu\nmove to sidebar\nhide\n\n\n\n\t\tNavigation\n\t\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\n\t\tContribute\n\t\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nLanguages\n\nLanguage links are at the top of the page across from the title.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCreate accountLog in\n\n\n\n\n\n\nPersonal tools\n\n\n\n\n Create account Log in\n\n\n\n\n\t\tPages for logged out editors learn more\n\n\nContributionsTalk\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContents\nmove to sidebar\nhide\n\n\n\n\n(Top)\n\n\n\n\n\n1Nomenclature\n\n\n\n\n\n\n\n2Overview\n\n\n\n\n\n\n\n3Crawling policy\n\n\n\t\t\t\tToggle Crawling policy subsection\n\t\t\t\n\n\n\n\n3.1Selection policy\n\n\n\n\n\n3.1.1Restricting followed links\n\n\n\n\n\n\n\n3.1.2URL normalization\n\n\n\n\n\n\n\n3.1.3Path-ascending crawling\n\n\n\n\n\n\n\n3.1.4Focused crawling\n\n\n\n\n\n3.1.4.1Academic focused crawler\n\n\n\n\n\n\n\n3.1.4.2Semantic focused crawler\n\n\n\n\n\n\n\n\n\n\n\n3.2Re-visit policy\n\n\n\n\n\n\n\n3.3Politeness policy\n\n\n\n\n\n\n\n3.4Parallelization policy\n\n\n\n\n\n\n\n\n\n4Architectures\n\n\n\n\n\n\n\n5Security\n\n\n\n\n\n\n\n6Crawler identification\n\n\n\n\n\n\n\n7Crawling the deep web\n\n\n\n\n\n\n\n8Visual vs programmatic crawlers\n\n\n\n\n\n\n\n9List of web crawlers\n\n\n\t\t\t\tToggle List of web crawlers subsection\n\t\t\t\n\n\n\n\n9.1Historical web crawlers\n\n\n\n\n\n\n\n9.2In-house web crawlers\n\n\n\n\n\n\n\n9.3Commercial web crawlers\n\n\n\n\n\n\n\n9.4Open-source crawlers\n\n\n\n\n\n\n\n\n\n10See also\n\n\n\n\n\n\n\n11References\n\n\n\n\n\n\n\n12Further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tToggle the table of contents\n\t\t\t\t\t\n\n\n\n\n\nToggle the table of contents\n\n\n\n\n\n\n\nWeb crawler\n\n\n\n\n43 languages\n\n\n\nAfrikaansالعربيةBoarischCatalàČeštinaCymraegالدارجةDeutschΕλληνικάEspañolEuskaraفارسیFrançais한국어ՀայերենHrvatskiBahasa IndonesiaInterlinguaItalianoעבריתLietuviųMagyarBahasa MelayuNederlandsNedersaksies日本語Norsk bokmålNorsk nynorskОлык марийPolskiPortuguêsRomânăРусскийSimple EnglishСрпски / srpskiSuomiSvenskaதமிழ்ไทยTürkçeУкраїнська文言中文\nEdit links\n\n\n\n\n\n\n\n\n\n\n\nArticle\n\nTalk\n\n\n\n\n\n\n\nEnglish\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead\n\nEdit\n\nView history\n\n\n\n\n\n\n\n\n\nTools\n\n\n\n\n\nTools\nmove to sidebar\nhide\n\n\n\n\t\tActions\n\t\n\nReadEditView history\n\n\n\n\n\t\tGeneral\n\t\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageWikidata item\n\n\n\n\n\t\tPrint/export\n\t\n\nDownload as PDFPrintable version\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrom Wikipedia, the free encyclopedia\n\n\nSoftware which systematically browses the World Wide Web\nThis article is about the internet bot. For the search engine, see WebCrawler. \"Web spider\" redirects here. Not to be confused with Spider web. \"Spiderbot\" redirects here. For the video game, see Arac (video game).\n\n\n Architecture of a Web crawler\nA Web crawler, sometimes called a spider or spiderbot and often shortened to crawler, is an Internet bot that systematically browses the World Wide Web and that is typically operated by search engines for the purpose of Web indexing (web spidering).[1]\nWeb search engines and some other websites use Web crawling or spidering software to update their web content or indices of other sites' web content. Web crawlers copy pages for processing by a search engine, which indexes the downloaded pages so that users can search more efficiently.\nCrawlers consume resources on visited systems and often visit sites unprompted. Issues of schedule, load, and \"politeness\" come into play when large collections of pages are accessed. Mechanisms exist for public sites not wishing to be crawled to make this known to the crawling agent. For example, including a robots.txt file can request bots to index only parts of a website, or nothing at all.\nThe number of Internet pages is extremely large; even the largest crawlers fall short of making a complete index. For this reason, search engines struggled to give relevant search results in the early years of the World Wide Web, before 2000. Today, relevant results are given almost instantly.\nCrawlers can validate hyperlinks and HTML code. They can also be used for web scraping and data-driven programming.\n\n\nNomenclature[edit]\nA web crawler is also known as a spider,[2] an ant, an automatic indexer,[3] or (in the FOAF software context) a Web scutter.[4]\n\nOverview[edit]\nA Web crawler starts with a list of URLs to visit. Those first URLs are called the seeds. As the crawler visits these URLs, by communicating with web servers that respond to those URLs, it identifies all the hyperlinks in the retrieved web pages and adds them to the list of URLs to visit, called the crawl frontier. URLs from the frontier are recursively visited according to a set of policies. If the crawler is performing archiving of websites (or web archiving), it copies and saves the information as it goes. The archives are usually stored in such a way they can be viewed, read and navigated as if they were on the live web, but are preserved as 'snapshots'.[5]\nThe archive is known as the repository and is designed to store and manage the collection of web pages. The repository only stores HTML pages and these pages are stored as distinct files. A repository is similar to any other system that stores data, like a modern-day database. The only difference is that a repository does not need all the functionality offered by a database system. The repository stores the most recent version of the web page retrieved by the crawler.[citation needed]\nThe large volume implies the crawler can only download a limited number of the Web pages within a given time, so it needs to prioritize its downloads. The high rate of change can imply the pages might have already been updated or even deleted.\nThe number of possible URLs crawled being generated by server-side software has also made it difficult for web crawlers to avoid retrieving duplicate content. Endless combinations of HTTP GET (URL-based) parameters exist, of which only a small selection will actually return unique content. For example, a simple online photo gallery may offer three options to users, as specified through HTTP GET parameters in the URL. If there exist four ways to sort images, three choices of thumbnail size, two file formats, and an option to disable user-provided content, then the same set of content can be accessed with 48 different URLs, all of which may be linked on the site. This mathematical combination creates a problem for crawlers, as they must sort through endless combinations of relatively minor scripted changes in order to retrieve unique content.\nAs Edwards et al. noted, \"Given that the bandwidth for conducting crawls is neither infinite nor free, it is becoming essential to crawl the Web in not only a scalable, but efficient way, if some reasonable measure of quality or freshness is to be maintained.\"[6] A crawler must carefully choose at each step which pages to visit next.\n\nCrawling policy[edit]\nThe behavior of a Web crawler is the outcome of a combination of policies:[7]\n\na selection policy which states the pages to download,\na re-visit policy which states when to check for changes to the pages,\na politeness policy that states how to avoid overloading Web sites.\na parallelization policy that states how to coordinate distributed web crawlers.\nSelection policy[edit]\nGiven the current size of the Web, even large search engines cover only a portion of the publicly available part. A 2009 study showed even large-scale search engines index no more than 40–70% of the indexable Web;[8] a previous study by Steve Lawrence and Lee Giles showed that no search engine indexed more than 16% of the Web in 1999.[9] As a crawler always downloads just a fraction of the Web pages, it is highly desirable for the downloaded fraction to contain the most relevant pages and not just a random sample of the Web.\nThis requires a metric of importance for prioritizing Web pages. The importance of a page is a function of its intrinsic quality, its popularity in terms of links or visits, and even of its URL (the latter is the case of vertical search engines restricted to a single top-level domain, or search engines restricted to a fixed Web site). Designing a good selection policy has an added difficulty: it must work with partial information, as the complete set of Web pages is not known during crawling.\nJunghoo Cho et al. made the first study on policies for crawling scheduling. Their data set was a 180,000-pages crawl from the stanford.edu domain, in which a crawling simulation was done with different strategies.[10] The ordering metrics tested were breadth-first, backlink count and partial PageRank calculations. One of the conclusions was that if the crawler wants to download pages with high Pagerank early during the crawling process, then the partial Pagerank strategy is the better, followed by breadth-first and backlink-count. However, these results are for just a single domain. Cho also wrote his PhD dissertation at Stanford on web crawling.[11]\nNajork and Wiener performed an actual crawl on 328 million pages, using breadth-first ordering.[12] They found that a breadth-first crawl captures pages with high Pagerank early in the crawl (but they did not compare this strategy against other strategies). The explanation given by the authors for this result is that \"the most important pages have many links to them from numerous hosts, and those links will be found early, regardless of on which host or page the crawl originates.\"\nAbiteboul designed a crawling strategy based on an algorithm called OPIC (On-line Page Importance Computation).[13] In OPIC, each page is given an initial sum of \"cash\" that is distributed equally among the pages it points to. It is similar to a PageRank computation, but it is faster and is only done in one step. An OPIC-driven crawler downloads first the pages in the crawling frontier with higher amounts of \"cash\". Experiments were carried in a 100,000-pages synthetic graph with a power-law distribution of in-links. However, there was no comparison with other strategies nor experiments in the real Web.\nBoldi et al. used simulation on subsets of the Web of 40 million pages from the .it domain and 100 million pages from the WebBase crawl, testing breadth-first against depth-first, random ordering and an omniscient strategy. The comparison was based on how well PageRank computed on a partial crawl approximates the true PageRank value. Surprisingly, some visits that accumulate PageRank very quickly (most notably, breadth-first and the omniscient visit) provide very poor progressive approximations.[14][15]\nBaeza-Yates et al. used simulation on two subsets of the Web of 3 million pages from the .gr and .cl domain, testing several crawling strategies.[16] They showed that both the OPIC strategy and a strategy that uses the length of the per-site queues are better than breadth-first crawling, and that it is also very effective to use a previous crawl, when it is available, to guide the current one.\nDaneshpajouh et al. designed a community based algorithm for discovering good seeds.[17] Their method crawls web pages with high PageRank from different communities in less iteration in comparison with crawl starting from random seeds. One can extract good seed from a previously-crawled-Web graph using this new method. Using these seeds, a new crawl can be very effective.\n\nRestricting followed links[edit]\nA crawler may only want to seek out HTML pages and avoid all other MIME types. In order to request only HTML resources, a crawler may make an HTTP HEAD request to determine a Web resource's MIME type before requesting the entire resource with a GET request. To avoid making numerous HEAD requests, a crawler may examine the URL and only request a resource if the URL ends with certain characters such as .html, .htm, .asp, .aspx, .php, .jsp, .jspx or a slash. This strategy may cause numerous HTML Web resources to be unintentionally skipped.\nSome crawlers may also avoid requesting any resources that have a \"?\" in them (are dynamically produced) in order to avoid spider traps that may cause the crawler to download an infinite number of URLs from a Web site. This strategy is unreliable if the site uses URL rewriting to simplify its URLs.\n\nURL normalization[edit]\nMain article: URL normalization\nCrawlers usually perform some type of URL normalization in order to avoid crawling the same resource more than once. The term URL normalization, also called URL canonicalization, refers to the process of modifying and standardizing a URL in a consistent manner. There are several types of normalization that may be performed including conversion of URLs to lowercase, removal of \".\" and \"..\" segments, and adding trailing slashes to the non-empty path component.[18]\n\nPath-ascending crawling[edit]\nSome crawlers intend to download/upload as many resources as possible from a particular web site. So path-ascending crawler was introduced that would ascend to every path in each URL that it intends to crawl.[19] For example, when given a seed URL of http://llama.org/hamster/monkey/page.html, it will attempt to crawl /hamster/monkey/, /hamster/, and /. Cothey found that a path-ascending crawler was very effective in finding isolated resources, or resources for which no inbound link would have been found in regular crawling.\n\nFocused crawling[edit]\nMain article: Focused crawler\nThe importance of a page for a crawler can also be expressed as a function of the similarity of a page to a given query. Web crawlers that attempt to download pages that are similar to each other are called focused crawler or topical crawlers. The concepts of topical and focused crawling were first introduced by Filippo Menczer[20][21] and by Soumen Chakrabarti et al.[22]\nThe main problem in focused crawling is that in the context of a Web crawler, we would like to be able to predict the similarity of the text of a given page to the query before actually downloading the page. A possible predictor is the anchor text of links; this was the approach taken by Pinkerton[23] in the first web crawler of the early days of the Web. Diligenti et al.[24] propose using the complete content of the pages already visited to infer the similarity between the driving query and the pages that have not been visited yet. The performance of a focused crawling depends mostly on the richness of links in the specific topic being searched, and a focused crawling usually relies on a general Web search engine for providing starting points.\n\nAcademic focused crawler[edit]\nAn example of the focused crawlers are academic crawlers, which crawls free-access academic related documents, such as the citeseerxbot, which is the crawler of CiteSeerX search engine. Other academic search engines are Google Scholar and Microsoft Academic Search etc. Because most academic papers are published in PDF formats, such kind of crawler is particularly interested in crawling PDF, PostScript files, Microsoft Word including their zipped formats. Because of this, general open-source crawlers, such as Heritrix, must be customized to filter out other MIME types, or a middleware is used to extract these documents out and import them to the focused crawl database and repository.[25] Identifying whether these documents are academic or not is challenging and can add a significant overhead to the crawling process, so this is performed as a post crawling process using machine learning or regular expression algorithms. These academic documents are usually obtained from home pages of faculties and students or from publication page of research institutes. Because academic documents make up only a small fraction of all web pages, a good seed selection is important in boosting the efficiencies of these web crawlers.[26] Other academic crawlers may download plain text and HTML files, that contains metadata of academic papers, such as titles, papers, and abstracts. This increases the overall number of papers, but a significant fraction may not provide free PDF downloads.\n\nSemantic focused crawler[edit]\nAnother type of focused crawlers is semantic focused crawler, which makes use of domain ontologies to represent topical maps and link Web pages with relevant ontological concepts for the selection and categorization purposes.[27] In addition, ontologies can be automatically updated in the crawling process. Dong et al.[28] introduced such an ontology-learning-based crawler using a support-vector machine to update the content of ontological concepts when crawling Web pages.\n\nRe-visit policy[edit]\nThe Web has a very dynamic nature, and crawling a fraction of the Web can take weeks or months. By the time a Web crawler has finished its crawl, many events could have happened, including creations, updates, and deletions.\nFrom the search engine's point of view, there is a cost associated with not detecting an event, and thus having an outdated copy of a resource. The most-used cost functions are freshness and age.[29]\nFreshness: This is a binary measure that indicates whether the local copy is accurate or not. The freshness of a page p in the repository at time t is defined as:\n\n\n\n\n\n\nF\n\np\n\n\n(\nt\n)\n=\n\n\n{\n\n\n\n1\n\n\n\n\ni\nf\n\n\n \np\n \n\n\n \ni\ns\n \ne\nq\nu\na\nl\n \nt\no\n \nt\nh\ne\n \nl\no\nc\na\nl\n \nc\no\np\ny\n \na\nt\n \nt\ni\nm\ne\n\n\n \nt\n\n\n\n\n0\n\n\n\n\no\nt\nh\ne\nr\nw\ni\ns\ne\n\n\n\n\n\n\n\n\n\n\n{\\displaystyle F_{p}(t)={\\begin{cases}1&{\\rm {if}}~p~{\\rm {~is~equal~to~the~local~copy~at~time}}~t\\\\0&{\\rm {otherwise}}\\end{cases}}}\n\n\nAge: This is a measure that indicates how outdated the local copy is. The age of a page p in the repository, at time t is defined as:\n\n\n\n\n\n\nA\n\np\n\n\n(\nt\n)\n=\n\n\n{\n\n\n\n0\n\n\n\n\ni\nf\n\n\n \np\n \n\n\n \ni\ns\n \nn\no\nt\n \nm\no\nd\ni\nf\ni\ne\nd\n \na\nt\n \nt\ni\nm\ne\n\n\n \nt\n\n\n\n\nt\n−\n\n\nm\no\nd\ni\nf\ni\nc\na\nt\ni\no\nn\n \nt\ni\nm\ne\n \no\nf\n\n\n \np\n\n\n\n\no\nt\nh\ne\nr\nw\ni\ns\ne\n\n\n\n\n\n\n\n\n\n\n{\\displaystyle A_{p}(t)={\\begin{cases}0&{\\rm {if}}~p~{\\rm {~is~not~modified~at~time}}~t\\\\t-{\\rm {modification~time~of}}~p&{\\rm {otherwise}}\\end{cases}}}\n\n\nCoffman et al. worked with a definition of the objective of a Web crawler that is equivalent to freshness, but use a different wording: they propose that a crawler must minimize the fraction of time pages remain outdated. They also noted that the problem of Web crawling can be modeled as a multiple-queue, single-server polling system, on which the Web crawler is the server and the Web sites are the queues. Page modifications are the arrival of the customers, and switch-over times are the interval between page accesses to a single Web site. Under this model, mean waiting time for a customer in the polling system is equivalent to the average age for the Web crawler.[30]\nThe objective of the crawler is to keep the average freshness of pages in its collection as high as possible, or to keep the average age of pages as low as possible. These objectives are not equivalent: in the first case, the crawler is just concerned with how many pages are out-dated, while in the second case, the crawler is concerned with how old the local copies of pages are.\n\n Evolution of Freshness and Age in a web crawler\nTwo simple re-visiting policies were studied by Cho and Garcia-Molina:[31]\n\nUniform policy: This involves re-visiting all pages in the collection with the same frequency, regardless of their rates of change.\nProportional policy: This involves re-visiting more often the pages that change more frequently. The visiting frequency is directly proportional to the (estimated) change frequency.\nIn both cases, the repeated crawling order of pages can be done either in a random or a fixed order.\nCho and Garcia-Molina proved the surprising result that, in terms of average freshness, the uniform policy outperforms the proportional policy in both a simulated Web and a real Web crawl. Intuitively, the reasoning is that, as web crawlers have a limit to how many pages they can crawl in a given time frame, (1) they will allocate too many new crawls to rapidly changing pages at the expense of less frequently updating pages, and (2) the freshness of rapidly changing pages lasts for shorter period than that of less frequently changing pages. In other words, a proportional policy allocates more resources to crawling frequently updating pages, but experiences less overall freshness time from them.\nTo improve freshness, the crawler should penalize the elements that change too often.[32] The optimal re-visiting policy is neither the uniform policy nor the proportional policy. The optimal method for keeping average freshness high includes ignoring the pages that change too often, and the optimal for keeping average age low is to use access frequencies that monotonically (and sub-linearly) increase with the rate of change of each page. In both cases, the optimal is closer to the uniform policy than to the proportional policy: as Coffman et al. note, \"in order to minimize the expected obsolescence time, the accesses to any particular page should be kept as evenly spaced as possible\".[30] Explicit formulas for the re-visit policy are not attainable in general, but they are obtained numerically, as they depend on the distribution of page changes. Cho and Garcia-Molina show that the exponential distribution is a good fit for describing page changes,[32] while Ipeirotis et al. show how to use statistical tools to discover parameters that affect this distribution.[33] Note that the re-visiting policies considered here regard all pages as homogeneous in terms of quality (\"all pages on the Web are worth the same\"), something that is not a realistic scenario, so further information about the Web page quality should be included to achieve a better crawling policy.\n\nPoliteness policy[edit]\nCrawlers can retrieve data much quicker and in greater depth than human searchers, so they can have a crippling impact on the performance of a site. If a single crawler is performing multiple requests per second and/or downloading large files, a server can have a hard time keeping up with requests from multiple crawlers.\nAs noted by Koster, the use of Web crawlers is useful for a number of tasks, but comes with a price for the general community.[34] The costs of using Web crawlers include:\n\nnetwork resources, as crawlers require considerable bandwidth and operate with a high degree of parallelism during a long period of time;\nserver overload, especially if the frequency of accesses to a given server is too high;\npoorly written crawlers, which can crash servers or routers, or which download pages they cannot handle; and\npersonal crawlers that, if deployed by too many users, can disrupt networks and Web servers.\nA partial solution to these problems is the robots exclusion protocol, also known as the robots.txt protocol that is a standard for administrators to indicate which parts of their Web servers should not be accessed by crawlers.[35] This standard does not include a suggestion for the interval of visits to the same server, even though this interval is the most effective way of avoiding server overload. Recently commercial search engines like Google, Ask Jeeves, MSN and Yahoo! Search are able to use an extra \"Crawl-delay:\" parameter in the robots.txt file to indicate the number of seconds to delay between requests.\nThe first proposed interval between successive pageloads was 60 seconds.[36] However, if pages were downloaded at this rate from a website with more than 100,000 pages over a perfect connection with zero latency and infinite bandwidth, it would take more than 2 months to download only that entire Web site; also, only a fraction of the resources from that Web server would be used. This does not seem acceptable.\nCho uses 10 seconds as an interval for accesses,[31] and the WIRE crawler uses 15 seconds as the default.[37] The MercatorWeb crawler follows an adaptive politeness policy: if it took t seconds to download a document from a given server, the crawler waits for 10t seconds before downloading the next page.[38] Dill et al. use 1 second.[39]\nFor those using Web crawlers for research purposes, a more detailed cost-benefit analysis is needed and ethical considerations should be taken into account when deciding where to crawl and how fast to crawl.[40]\nAnecdotal evidence from access logs shows that access intervals from known crawlers vary between 20 seconds and 3–4 minutes. It is worth noticing that even when being very polite, and taking all the safeguards to avoid overloading Web servers, some complaints from Web server administrators are received. Brin and Page note that: \"... running a crawler which connects to more than half a million servers ... generates a fair amount of e-mail and phone calls. Because of the vast number of people coming on line, there are always those who do not know what a crawler is, because this is the first one they have seen.\"[41]\n\nParallelization policy[edit]\nMain article: Distributed web crawling\nA parallel crawler is a crawler that runs multiple processes in parallel. The goal is to maximize the download rate while minimizing the overhead from parallelization and to avoid repeated downloads of the same page. To avoid downloading the same page more than once, the crawling system requires a policy for assigning the new URLs discovered during the crawling process, as the same URL can be found by two different crawling processes.\n\nArchitectures[edit]\n High-level architecture of a standard Web crawler\nA crawler must not only have a good crawling strategy, as noted in the previous sections, but it should also have a highly optimized architecture.\nShkapenyuk and Suel noted that:[42]\n\nWhile it is fairly easy to build a slow crawler that downloads a few pages per second for a short period of time, building a high-performance system that can download hundreds of millions of pages over several weeks presents a number of challenges in system design, I/O and network efficiency, and robustness and manageability.\nWeb crawlers are a central part of search engines, and details on their algorithms and architecture are kept as business secrets. When crawler designs are published, there is often an important lack of detail that prevents others from reproducing the work. There are also emerging concerns about \"search engine spamming\", which prevent major search engines from publishing their ranking algorithms.\n\nSecurity[edit]\nWhile most of the website owners are keen to have their pages indexed as broadly as possible to have strong presence in search engines, web crawling can also have unintended consequences and lead to a compromise or data breach if a search engine indexes resources that shouldn't be publicly available, or pages revealing potentially vulnerable versions of software.\n\nMain article: Google hacking\nApart from standard web application security recommendations website owners can reduce their exposure to opportunistic hacking by only allowing search engines to index the public parts of their websites (with robots.txt) and explicitly blocking them from indexing transactional parts (login pages, private pages, etc.).\n\nCrawler identification[edit]\nWeb crawlers typically identify themselves to a Web server by using the User-agent field of an HTTP request. Web site administrators typically examine their Web servers' log and use the user agent field to determine which crawlers have visited the web server and how often. The user agent field may include a URL where the Web site administrator may find out more information about the crawler. Examining Web server log is tedious task, and therefore some administrators use tools to identify, track and verify Web crawlers. Spambots and other malicious Web crawlers are unlikely to place identifying information in the user agent field, or they may mask their identity as a browser or other well-known crawler.\nWeb site administrators prefer Web crawlers to identify themselves so that they can contact the owner if needed. In some cases, crawlers may be accidentally trapped in a crawler trap or they may be overloading a Web server with requests, and the owner needs to stop the crawler. Identification is also useful for administrators that are interested in knowing when they may expect their Web pages to be indexed by a particular search engine.\n\nCrawling the deep web[edit]\nA vast amount of web pages lie in the deep or invisible web.[43] These pages are typically only accessible by submitting queries to a database, and regular crawlers are unable to find these pages if there are no links that point to them. Google's Sitemaps protocol and mod oai[44] are intended to allow discovery of these deep-Web resources.\nDeep web crawling also multiplies the number of web links to be crawled. Some crawlers only take some of the URLs in <a href=\"URL\"> form. In some cases, such as the Googlebot, Web crawling is done on all text contained inside the hypertext content, tags, or text.\nStrategic approaches may be taken to target deep Web content. With a technique called screen scraping, specialized software may be customized to automatically and repeatedly query a given Web form with the intention of aggregating the resulting data. Such software can be used to span multiple Web forms across multiple Websites. Data extracted from the results of one Web form submission can be taken and applied as input to another Web form thus establishing continuity across the Deep Web in a way not possible with traditional web crawlers.[45]\nPages built on AJAX are among those causing problems to web crawlers. Google has proposed a format of AJAX calls that their bot can recognize and index.[46]\n\nVisual vs programmatic crawlers[edit]\nThere are a number of \"visual web scraper/crawler\" products available on the web which will crawl pages and structure data into columns and rows based on the users requirements. One of the main difference between a classic and a visual crawler is the level of programming ability required to set up a crawler. The latest generation of \"visual scrapers\" remove the majority of the programming skill needed to be able to program and start a crawl to scrape web data.\nThe visual scraping/crawling method relies on the user \"teaching\" a piece of crawler technology, which then follows patterns in semi-structured data sources. The dominant method for teaching a visual crawler is by highlighting data in a browser and training columns and rows. While the technology is not new, for example it was the basis of Needlebase which has been bought by Google (as part of a larger acquisition of ITA Labs[47]), there is continued growth and investment in this area by investors and end-users.[citation needed]\n\nList of web crawlers[edit]\nFurther information: List of search engine software\nThe following is a list of published crawler architectures for general-purpose crawlers (excluding focused web crawlers), with a brief description that includes the names given to the different components and outstanding features:\n\nHistorical web crawlers[edit]\nWorld Wide Web Worm was a crawler used to build a simple index of document titles and URLs. The index could be searched by using the grep Unix command.\nYahoo! Slurp was the name of the Yahoo! Search crawler until Yahoo! contracted with Microsoft to use Bingbot instead.\nIn-house web crawlers[edit]\nApplebot is Apple's web crawler. It supports Siri and other products.[48]\nBingbot is the name of Microsoft's Bing webcrawler. It replaced Msnbot.\nBaiduspider is Baidu's web crawler.\nGooglebot is described in some detail, but the reference is only about an early version of its architecture, which was written in C++ and Python. The crawler was integrated with the indexing process, because text parsing was done for full-text indexing and also for URL extraction. There is a URL server that sends lists of URLs to be fetched by several crawling processes. During parsing, the URLs found were passed to a URL server that checked if the URL have been previously seen. If not, the URL was added to the queue of the URL server.\nWebCrawler was used to build the first publicly available full-text index of a subset of the Web. It was based on lib-WWW to download pages, and another program to parse and order URLs for breadth-first exploration of the Web graph. It also included a real-time crawler that followed links based on the similarity of the anchor text with the provided query.\nWebFountain is a distributed, modular crawler similar to Mercator but written in C++.\nXenon is a web crawler used by government tax authorities to detect fraud.[49][50]\nCommercial web crawlers[edit]\nThe following web crawlers are available, for a price::\n\nDiffbot - programmatic general web crawler, available as an API\nSortSite - crawler for analyzing websites, available for Windows and Mac OS\nSwiftbot - Swiftype's web crawler, available as software as a service\nOpen-source crawlers[edit]\nGNU Wget is a command-line-operated crawler written in C and released under the GPL. It is typically used to mirror Web and FTP sites.\nGRUB was an open source distributed search crawler that Wikia Search used to crawl the web.\nHeritrix is the Internet Archive's archival-quality crawler, designed for archiving periodic snapshots of a large portion of the Web. It was written in Java.\nht://Dig includes a Web crawler in its indexing engine.\nHTTrack uses a Web crawler to create a mirror of a web site for off-line viewing. It is written in C and released under the GPL.\nmnoGoSearch is a crawler, indexer and a search engine written in C and licensed under the GPL (*NIX machines only)\nApache Nutch is a highly extensible and scalable web crawler written in Java and released under an Apache License. It is based on Apache Hadoop and can be used with Apache Solr or Elasticsearch.\nOpen Search Server is a search engine and web crawler software release under the GPL.\nScrapy, an open source webcrawler framework, written in python (licensed under BSD).\nSeeks, a free distributed search engine (licensed under AGPL).\nStormCrawler, a collection of resources for building low-latency, scalable web crawlers on Apache Storm (Apache License).\ntkWWW Robot, a crawler based on the tkWWW web browser (licensed under GPL).\nXapian, a search crawler engine, written in c++.\nYaCy, a free distributed search engine, built on principles of peer-to-peer networks (licensed under GPL).\nSee also[edit]\nAutomatic indexing\nGnutella crawler\nWeb archiving\nWebgraph\nWebsite mirroring software\nSearch Engine Scraping\nWeb scraping\nReferences[edit]\n\n\n^ \"Web Crawlers: Browsing the Web\". Archived from the original on 6 December 2021.\n\n^ Spetka, Scott. \"The TkWWW Robot: Beyond Browsing\". NCSA. Archived from the original on 3 September 2004. Retrieved 21 November 2010.\n\n^ Kobayashi, M. & Takeda, K. (2000). \"Information retrieval on the web\". ACM Computing Surveys. 32 (2): 144–173. CiteSeerX 10.1.1.126.6094. doi:10.1145/358923.358934. S2CID 3710903.\n\n^ See definition of scutter on FOAF Project's wiki Archived 13 December 2009 at the Wayback Machine\n\n^ Masanès, Julien (15 February 2007). Web Archiving. Springer. p. 1. ISBN 978-3-54046332-0. Retrieved 24 April 2014.\n\n^ Edwards, J.; McCurley, K. S.; and Tomlin, J. A. (2001). \"An adaptive model for optimizing performance of an incremental web crawler\". Proceedings of the tenth international conference on World Wide Web - WWW '01. In Proceedings of the Tenth Conference on World Wide Web. pp. 106–113. CiteSeerX 10.1.1.1018.1506. doi:10.1145/371920.371960. ISBN 978-1581133486. S2CID 10316730.{{cite book}}:  CS1 maint: multiple names: authors list (link)\n\n^ Castillo, Carlos (2004). Effective Web Crawling (PhD thesis). University of Chile. Retrieved 3 August 2010.\n\n^ Gulls, A.; A. Signori (2005). \"The indexable web is more than 11.5 billion pages\". Special interest tracks and posters of the 14th international conference on World Wide Web. ACM Press. pp. 902–903. doi:10.1145/1062745.1062789.\n\n^ Lawrence, Steve; C. Lee Giles (8 July 1999). \"Accessibility of information on the web\". Nature. 400 (6740): 107–9. Bibcode:1999Natur.400..107L. doi:10.1038/21987. PMID 10428673. S2CID 4347646.\n\n^ Cho, J.; Garcia-Molina, H.; Page, L. (April 1998). \"Efficient Crawling Through URL Ordering\". Seventh International World-Wide Web Conference. Brisbane, Australia. doi:10.1142/3725. ISBN 978-981-02-3400-3. Retrieved 23 March 2009.\n\n^ Cho, Junghoo, \"Crawling the Web: Discovery and Maintenance of a Large-Scale Web Data\", PhD dissertation, Department of Computer Science, Stanford University, November 2001.\n\n^ Najork, Marc and Janet L. Wiener. \"Breadth-first crawling yields high-quality pages\". In: Proceedings of the Tenth Conference on World Wide Web, pages 114–118, Hong Kong, May 2001. Elsevier Science.\n\n^ Abiteboul, Serge; Mihai Preda; Gregory Cobena (2003). \"Adaptive on-line page importance computation\". Proceedings of the 12th international conference on World Wide Web. Budapest, Hungary: ACM. pp. 280–290. doi:10.1145/775152.775192. ISBN 1-58113-680-3. Retrieved 22 March 2009.\n\n^ Boldi, Paolo; Bruno Codenotti; Massimo Santini; Sebastiano Vigna (2004). \"UbiCrawler: a scalable fully distributed Web crawler\" (PDF). Software: Practice and Experience. 34 (8): 711–726. CiteSeerX 10.1.1.2.5538. doi:10.1002/spe.587. S2CID 325714. Archived from the original (PDF) on 20 March 2009. Retrieved 23 March 2009.\n\n^ Boldi, Paolo; Massimo Santini; Sebastiano Vigna (2004). \"Do Your Worst to Make the Best: Paradoxical Effects in PageRank Incremental Computations\" (PDF). Algorithms and Models for the Web-Graph. Lecture Notes in Computer Science. Vol. 3243. pp. 168–180. doi:10.1007/978-3-540-30216-2_14. ISBN 978-3-540-23427-2. Retrieved 23 March 2009.\n\n^ Baeza-Yates, R.; Castillo, C.;  Marin, M. and Rodriguez, A. (2005). \"Crawling a Country: Better Strategies than Breadth-First for Web Page Ordering.\" In: Proceedings of the Industrial and Practical Experience track of the 14th conference on World Wide Web, pages 864–872, Chiba, Japan. ACM Press.\n\n^ Shervin Daneshpajouh, Mojtaba Mohammadi Nasiri, Mohammad Ghodsi, A Fast Community Based Algorithm for Generating Crawler Seeds Set. In: Proceedings of 4th International Conference on Web Information Systems and Technologies (Webist-2008), Funchal, Portugal, May 2008.\n\n^ Pant, Gautam; Srinivasan, Padmini; Menczer, Filippo (2004). \"Crawling the Web\" (PDF).  In Levene, Mark; Poulovassilis, Alexandra (eds.). Web Dynamics: Adapting to Change in Content, Size, Topology and Use. Springer. pp. 153–178. ISBN 978-3-540-40676-1. Archived from the original (PDF) on 20 March 2009. Retrieved 9 May 2006.\n\n^ Cothey, Viv (2004). \"Web-crawling reliability\" (PDF). Journal of the American Society for Information Science and Technology. 55 (14): 1228–1238. CiteSeerX 10.1.1.117.185. doi:10.1002/asi.20078.\n\n^ Menczer, F. (1997). ARACHNID: Adaptive Retrieval Agents Choosing Heuristic Neighborhoods for Information Discovery Archived 21 December 2012 at the Wayback Machine. In D. Fisher, ed., Machine Learning: Proceedings of the 14th International Conference (ICML97). Morgan Kaufmann\n\n^ Menczer, F. and Belew, R.K. (1998). Adaptive Information Agents in Distributed Textual Environments Archived 21 December 2012 at the Wayback Machine. In K. Sycara and M. Wooldridge (eds.) Proc. 2nd Intl. Conf. on Autonomous Agents (Agents '98). ACM Press\n\n^ Chakrabarti, Soumen; Van Den Berg, Martin; Dom, Byron (1999). \"Focused crawling: A new approach to topic-specific Web resource discovery\" (PDF). Computer Networks. 31 (11–16): 1623–1640. doi:10.1016/s1389-1286(99)00052-3. Archived from the original (PDF) on 17 March 2004.\n\n^ Pinkerton, B. (1994). Finding what people want: Experiences with the WebCrawler. In Proceedings of the First World Wide Web Conference, Geneva, Switzerland.\n\n^ Diligenti, M., Coetzee, F., Lawrence, S., Giles, C. L., and Gori, M. (2000). Focused crawling using context graphs. In Proceedings of 26th International Conference on Very Large Databases (VLDB), pages 527-534, Cairo, Egypt.\n\n^ Wu, Jian; Teregowda, Pradeep; Khabsa, Madian; Carman, Stephen; Jordan, Douglas; San Pedro Wandelmer, Jose; Lu, Xin; Mitra, Prasenjit; Giles, C. Lee (2012). \"Web crawler middleware for search engine digital libraries\". Proceedings of the twelfth international workshop on Web information and data management - WIDM '12. p. 57. doi:10.1145/2389936.2389949. ISBN 9781450317207. S2CID 18513666.\n\n^ Wu, Jian; Teregowda, Pradeep; Ramírez, Juan Pablo Fernández; Mitra, Prasenjit; Zheng, Shuyi; Giles, C. Lee (2012). \"The evolution of a crawling strategy for an academic document search engine\". Proceedings of the 3rd Annual ACM Web Science Conference on - Web Sci '12. pp. 340–343. doi:10.1145/2380718.2380762. ISBN 9781450312288. S2CID 16718130.\n\n^ Dong, Hai; Hussain, Farookh Khadeer; Chang, Elizabeth (2009). \"State of the Art in Semantic Focused Crawlers\". Computational Science and Its Applications – ICCSA 2009. Lecture Notes in Computer Science. Vol. 5593. pp. 910–924. doi:10.1007/978-3-642-02457-3_74. hdl:20.500.11937/48288. ISBN 978-3-642-02456-6.\n\n^ Dong, Hai; Hussain, Farookh Khadeer (2013). \"SOF: A semi-supervised ontology-learning-based focused crawler\". Concurrency and Computation: Practice and Experience. 25 (12): 1755–1770. doi:10.1002/cpe.2980. S2CID 205690364.\n\n^ Junghoo Cho; Hector Garcia-Molina (2000). \"Synchronizing a database to improve freshness\" (PDF). Proceedings of the 2000 ACM SIGMOD international conference on Management of data. Dallas, Texas, United States: ACM. pp. 117–128. doi:10.1145/342009.335391. ISBN 1-58113-217-4. Retrieved 23 March 2009.\n\n^ a b E. G. Coffman Jr; Zhen Liu; Richard R. Weber (1998). \"Optimal robot scheduling for Web search engines\". Journal of Scheduling. 1 (1): 15–29. CiteSeerX 10.1.1.36.6087. doi:10.1002/(SICI)1099-1425(199806)1:1<15::AID-JOS3>3.0.CO;2-K.\n\n^ a b Cho, Junghoo; Garcia-Molina, Hector (2003). \"Effective page refresh policies for Web crawlers\". ACM Transactions on Database Systems. 28 (4): 390–426. doi:10.1145/958942.958945. S2CID 147958.\n\n^ a b Junghoo Cho; Hector Garcia-Molina (2003). \"Estimating frequency of change\". ACM Transactions on Internet Technology. 3 (3): 256–290. CiteSeerX 10.1.1.59.5877. doi:10.1145/857166.857170. S2CID 9362566.\n\n^ Ipeirotis, P., Ntoulas, A., Cho, J., Gravano, L. (2005) Modeling and managing content changes in text databases. In Proceedings of the 21st IEEE International Conference on Data Engineering, pages 606-617, April 2005, Tokyo.\n\n^ Koster, M. (1995). Robots in the web: threat or treat? ConneXions, 9(4).\n\n^ Koster, M. (1996). A standard for robot exclusion Archived 7 November 2007 at the Wayback Machine.\n\n^ Koster, M. (1993). Guidelines for robots writers Archived 22 April 2005 at the Wayback Machine.\n\n^ Baeza-Yates, R. and Castillo, C. (2002). Balancing volume, quality and freshness in Web crawling. In Soft Computing Systems – Design, Management and Applications, pages 565–572, Santiago, Chile. IOS Press Amsterdam.\n\n^ Heydon, Allan; Najork, Marc (26 June 1999). \"Mercator: A Scalable, Extensible Web Crawler\" (PDF). Archived from the original (PDF) on 19 February 2006. Retrieved 22 March 2009. {{cite journal}}: Cite journal requires |journal= (help)\n\n^ Dill, S.; Kumar, R.; Mccurley, K. S.; Rajagopalan, S.; Sivakumar, D.; Tomkins, A. (2002). \"Self-similarity in the web\" (PDF). ACM Transactions on Internet Technology. 2 (3): 205–223. doi:10.1145/572326.572328. S2CID 6416041.\n\n^ M. Thelwall; D. Stuart (2006). \"Web crawling ethics revisited: Cost, privacy and denial of service\". Journal of the American Society for Information Science and Technology. 57 (13): 1771–1779. doi:10.1002/asi.20388.\n\n^ Brin, Sergey; Page, Lawrence (1998). \"The anatomy of a large-scale hypertextual Web search engine\". Computer Networks and ISDN Systems. 30 (1–7): 107–117. doi:10.1016/s0169-7552(98)00110-x.\n\n^ Shkapenyuk, V. and Suel, T. (2002). Design and implementation of a high performance distributed web crawler. In Proceedings of the 18th International Conference on Data Engineering (ICDE), pages 357-368, San Jose, California. IEEE CS Press.\n\n^ Shestakov, Denis (2008). Search Interfaces on the Web: Querying and Characterizing Archived 6 July 2014 at the Wayback Machine. TUCS Doctoral Dissertations 104, University of Turku\n\n^ Michael L Nelson; Herbert Van de Sompel; Xiaoming Liu; Terry L Harrison; Nathan McFarland (24 March 2005). \"mod_oai: An Apache Module for Metadata Harvesting\": cs/0503069. arXiv:cs/0503069. Bibcode:2005cs........3069N. {{cite journal}}: Cite journal requires |journal= (help)\n\n^ Shestakov, Denis; Bhowmick, Sourav S.; Lim, Ee-Peng (2005). \"DEQUE: Querying the Deep Web\" (PDF). Data & Knowledge Engineering. 52 (3): 273–311. doi:10.1016/s0169-023x(04)00107-7.\n\n^ \"AJAX crawling: Guide for webmasters and developers\". Retrieved 17 March 2013.\n\n^ ITA Labs \"ITA Labs Acquisition\" 20 April 2011 1:28 AM\n\n^ \"About Applebot\". Apple Inc. Retrieved 18 October 2021.\n\n^ \nNorton, Quinn (25 January 2007). \"Tax takers send in the spiders\". Business. Wired. Archived from the original on 22 December 2016. Retrieved 13 October 2017.\n\n^ \n\"Xenon web crawling initiative: privacy impact assessment (PIA) summary\". Ottawa: Government of Canada. 11 April 2017. Archived from the original on 25 September 2017. Retrieved 13 October 2017.\n\n\nFurther reading[edit]\nCho, Junghoo, \"Web Crawling Project\", UCLA Computer Science Department.\nA History of Search Engines, from Wiley\nWIVET is a benchmarking project by OWASP, which aims to measure if a web crawler can identify all the hyperlinks in a target website.\nShestakov, Denis, \"Current Challenges in Web Crawling\" and \"Intelligent Web Crawling\", slides for tutorials given at ICWE'13 and WI-IAT'13.\nvteInternet searchTypes\nWeb search engine (List)\nMetasearch engine\nMultimedia search\nCollaborative search engine\nCross-language search\nLocal search\nVertical search\nSocial search\nImage search\nAudio search\nVideo search engine\nEnterprise search\nSemantic search\nNatural language search engine\nVoice search\nTools\nSearch by sound\nSearch engine marketing\nSearch engine optimization\nEvaluation measures\nSearch oriented architecture\nSelection-based search\nDocument retrieval\nText mining\nWeb crawler\nMultisearch\nFederated search\nSearch aggregator\nIndex/Web indexing\nFocused crawler\nSpider trap\nRobots exclusion standard\nDistributed web crawling\nWeb archiving\nWebsite mirroring software\nWeb query\nWeb query classification\nProtocolsand standards\nZ39.50\nSearch/Retrieve Web Service\nSearch/Retrieve via URL\nOpenSearch\nRepresentational State Transfer\nWebsite Parse Template\nWide area information server\nSee also\nSearch engine\nDesktop search\nOnline search\n\nvteWeb crawlersInternet bots designed for Web crawling and Web indexingActive\n80legs\nbingbot\nFetcher\nGooglebot\nHeritrix\nHTTrack\nPHP-Crawler\nPowerMapper\nWget\nDiscontinued\nFAST Crawler\nmsnbot\nRBSE\nTkWWW robot\nTwiceler\nTypes\nDistributed web crawler\nFocused crawler\n\nAuthority control: National \nGermany\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Web_crawler&oldid=1148994360\"\nCategories: Search engine softwareWeb crawlersInternet search algorithmsHidden categories: Webarchive template wayback linksCS1 maint: multiple names: authors listCS1 errors: missing periodicalArticles with short descriptionShort description is different from WikidataUse dmy dates from September 2020All articles with unsourced statementsArticles with unsourced statements from February 2023Articles with unsourced statements from June 2021Articles with GND identifiers\n\n\n\n\n\n\n This page was last edited on 9 April 2023, at 14:31 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License 3.0;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n\n\n\n", "keyword_freq": {"spider": 4}}, {"title": "Make your donation now - Wikimedia Foundation", "text": "\n\n\n\nMake your donation now - Wikimedia Foundation\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMake your donation now\n\n\n\n\nJump to navigation\nJump to search\n\n\n\n\n\n\nTemplate:2011FR/Appeal-default/title/en\n\n\n\n\n\nWe want everyone to have equal access to knowledge, forever\nThank you for considering a donation to the Wikimedia Foundation, the nonprofit that hosts Wikipedia and other crucial free knowledge projects.\nEach year, because of the 2% of readers who give to support our mission, we can expand the reach of free knowledge to new corners of the world. If Wikipedia matters and is useful to you too, please join them and donate $5, $20, $50 or whatever feels right to you today.\nWikipedia is different. No advertising, no subscription fees, no paywalls. Those don't belong here. Wikipedia is a place to learn, free from bias or agenda.\nToday, we invite you to donate whatever feels right. Show the world that access to independent and unbiased information matters to you.\nThank you.\n\n\n\n\nSorry, we're having a little trouble detecting what country you're in. Please visit Ways to Give for international payment methods.\n\n\n\n\n\n\n\n\n\n\nRetrieved from \"https://donate.wikimedia.org/wiki/Special:LandingPage\"\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nEnglishLog in\n\n\n\n\n\nNamespaces\n\n\nSpecial page\n\n\n\n\n\nEnglish\n\n\n\n\n\n\n\n\n\nViews\n\n\n\n\n\n\n\n\nMore\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nSupport pages indexOther ways to giveProblems donatingCancel or change recurring givingMatching Gifts\n\n\n\n\nWiki\n\n\nRecent changesDocumentation (collab)\n\n\n\n\nTools\n\n\nSpecial pagesPrintable version\n\n\n\n\n\n\n\n\nPrivacy policy\nAbout Donate\nDisclaimers\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n", "keyword_freq": {"spider": 0}}, {"title": "Webkruiper - Wikipedia", "text": "\n\n\n\nWebkruiper - Wikipedia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGaan na inhoud\n\n\n\n\n\n\n\n\nHoofkieslys\n\n\n\n\n\nHoofkieslys\nskuif na kantbalk\nversteek\n\n\n\n\t\tNavigasie\n\t\n\nTuisbladGebruikersportaalGeselshoekieOnlangse wysigingsLukrake bladsyHulpSandputSkenkings\n\n\n\n\nTale\n\nOp hierdie Wikipedia is die taalskakels bo-aan die bladsy oorkant die artikeltitel. Gaan boontoe.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSoek\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkep gebruikerMeld aan\n\n\n\n\n\n\nPersoonlike gereedskap\n\n\n\n\n Skep gebruiker Meld aan\n\n\n\n\n\t\tBladsye vir uitgemelde redakteurs leer meer\n\n\nBydraesBespreking\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInhoud\nskuif na kantbalk\nversteek\n\n\n\n\nInleiding\n\n\n\n\n\n1Robots.txt\n\n\n\n\n\n\n\n2Voetnotas\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWissel die inhoudsopgawe\n\t\t\t\t\t\n\n\n\n\n\nWissel die inhoudsopgawe\n\n\n\n\n\n\n\nWebkruiper\n\n\n\n\n43 tale\n\n\n\nالعربيةالدارجةBoarischCatalàČeštinaCymraegDeutschΕλληνικάEnglishEspañolEuskaraفارسیSuomiFrançaisעבריתHrvatskiMagyarՀայերենInterlinguaBahasa IndonesiaItaliano日本語한국어LietuviųОлык марийBahasa MelayuNedersaksiesNederlandsNorsk nynorskNorsk bokmålPolskiPortuguêsRomânăРусскийSimple EnglishСрпски / srpskiSvenskaதமிழ்ไทยTürkçeУкраїнська中文文言\nWysig skakels\n\n\n\n\n\n\n\n\n\n\n\nBladsy\n\nBespreking\n\n\n\n\n\n\n\nAfrikaans\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLees\n\nRedigeer\n\nWysig bron\n\nWys geskiedenis\n\n\n\n\n\n\n\n\n\nGereedskap\n\n\n\n\n\nGereedskap\nskuif na kantbalk\nversteek\n\n\n\n\t\tActions\n\t\n\nLeesRedigeerWysig bronWys geskiedenis\n\n\n\n\n\t\tAlgemeen\n\t\n\nSkakels hierheenVerwante veranderingsSpesiale bladsyePermanente skakelBladinligtingHaal dié blad aanWikidata-item\n\n\n\n\n\t\tDruk/uitvoer\n\t\n\nSkep boekLaai af as PDFDrukbare weergawe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nin Wikipedia, die vrye ensiklopedie\n\n\n'n Webkruiper (Engels: webcrawler of spider) is 'n sagteware robot wat die wêreldwyde web op 'n metodiese en geoutomatiseerde manier deurblaai. Webkruipers maak gewoonlik 'n lokale kopie van die opgeroepte bladsye om hulle sodoende later te kan verwerk, soos byvoorbeeld om hulle te indekseer vir soekenjins.\nDie werkswyse is eenvoudig: die webkruiper begin met 'n lys van URL addresse en besoek hulle een vir een, waarby ál die webskakels wat in die besoekte bladsye voorkom ook aan die lys van addresse toegevoeg word. Op dié wyse kan 'n webkruiper feitlik alle toeganklike bladsye op die internet besoek.\nWebkruipers kan bladsye baie vinniger as mense opvra en verwerk, en dit is dus belangrik dat hulle hulself gedra sodat hulle nie die webbedieners wat die webblaaie beskikbaarstel oorlaai nie. Die meeste webkruipers neem die moeite om bladsye van een webbediener nie almal ágter mekaar op te vra maar om hulle oor 'n tydsbestek te versprei om sodoende te verhoed dat die betreffende webbediener oorlaai word.\n\nRobots.txt[wysig | wysig bron]\nVir eienaars en administrateurs van webwerwe is metodes beskikbaar gestel om die gedrag van webkruipers te beïnvloed. So kan in die wortel (Engels: root) van 'n webwerf 'n tekslêer namens 'robots.txt' geplaas word, wat beperkings vir webkruipers voorskryf. Daar kan aangegee word watter dele van die webwerf deur bepaalde webkruipers nie besoek mag word nie. 'n Goeie webkruiper sal dus voor dit 'n webwerf bekruip, eers hierdie lêer opsoek en kyk of daar enige toepaslike beperkings aangegee word.[1]\nSommige webkruipers ignoreer die robots.txt lêer wat nadelige gevolge vir die besoekte webwerf kan inhou. Om dit teen te werk kan mens op 'n webbediener die IP-adresse van die betreffende webkruipers blokkeer.\n\nVoetnotas[wysig | wysig bron]\n\n\n↑ Sien byvoorbeeld die tekslêer robots.txt van Wikipedia.\n\n\n\n\n\n\nOntsluit van \"https://af.wikipedia.org/w/index.php?title=Webkruiper&oldid=2248551\"\nKategorie: Internet\n\n\n\n\n\n\n Die bladsy is laas op 8 Augustus 2020 om 00:30 bygewerk.\nDie teks is beskikbaar onder die lisensie Creative Commons Erkenning-Insgelyks Deel. Aanvullende voorwaardes kan moontlik ook van toepassing wees. Sien die Algemene Voorwaardes vir meer inligting.\n\n\nPrivaatheidsbeleid\nInligting oor Wikipedia\nVrywaring\nSelfoonweergawe\nOntwikkelaars\nStatistieke\nKoekieverklaring\n\n\n\n\n\n\n\n\n\n\n", "keyword_freq": {"spider": 0}}, {"title": "زاحف الشبكة - ويكيبيديا", "text": "\n\n\n\nزاحف الشبكة - ويكيبيديا\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nانتقل إلى المحتوى\n\n\n\n\n\n\n\n\nالقائمة الرئيسية\n\n\n\n\n\nالقائمة الرئيسية\nانقل للشريط الجانبي\nأخف\n\n\n\n\t\tالموسوعة\n\t\n\nالصفحة الرئيسيةالأحداث الجاريةأحدث التغييراتأحدث التغييرات الأساسية\n\n\n\n\n\t\tتصفح\n\t\n\nالمواضيعأبجديبواباتمقالة عشوائيةتصفح من غير إنترنت\n\n\n\n\n\t\tمشاركة\n\t\n\nتواصل مع ويكيبيديامساعدةالميدانتبرع\n\n\n\n\nلغات\n\nفي نسخة ويكيبيديا هذه، وصلات اللغات موجودة في الزاوية العليا اليسرى بجانب العنوان. انتقل إلى الأعلى.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nبحث\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nإنشاء حسابدخول\n\n\n\n\n\n\nأدوات شخصية\n\n\n\n\n إنشاء حساب دخول\n\n\n\n\n\t\tصفحات للمحررين الذين سجَّلوا خروجهم تعلَّم المزيد\n\n\nمساهماتنقاش\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nالمحتويات\nانقل للشريط الجانبي\nأخف\n\n\n\n\nالمقدمة\n\n\n\n\n\n1سلوك زاحف الشبكة\n\n\n\n\n\n\n\n2سياسة الانتقاء\n\n\n\n\n\n\n\n3المصادر\n\n\n\n\n\n\n\n4انظر أيضًا\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tتبديل عرض جدول المحتويات\n\t\t\t\t\t\n\n\n\n\n\nتبديل عرض جدول المحتويات\n\n\n\n\n\n\n\nزاحف الشبكة\n\n\n\n\n43 لغة\n\n\n\nAfrikaansالدارجةBoarischCatalàČeštinaCymraegDeutschΕλληνικάEnglishEspañolEuskaraفارسیSuomiFrançaisעבריתHrvatskiMagyarՀայերենInterlinguaBahasa IndonesiaItaliano日本語한국어LietuviųОлык марийBahasa MelayuNedersaksiesNederlandsNorsk nynorskNorsk bokmålPolskiPortuguêsRomânăРусскийSimple EnglishСрпски / srpskiSvenskaதமிழ்ไทยTürkçeУкраїнська中文文言\nعدل الوصلات\n\n\n\n\n\n\n\n\n\n\n\nمقالة\n\nنقاش\n\n\n\n\n\n\n\nالعربية\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nاقرأ\n\nعدّل\n\nتاريخ\n\n\n\n\n\n\n\n\n\nأدوات\n\n\n\n\n\nأدوات\nانقل للشريط الجانبي\nأخف\n\n\n\n\t\tأفعال\n\t\n\nاقرأعدّلتاريخ\n\n\n\n\n\t\tعام\n\t\n\nماذا يصل هناتغييرات ذات علاقةرفع ملفالصفحات الخاصةوصلة دائمةمعلومات الصفحةاستشهد بهذه الصفحةعنصر ويكي بيانات\n\n\n\n\n\t\tطباعة/تصدير\n\t\n\nإنشاء كتابتحميل PDFنسخة للطباعة\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nمن ويكيبيديا، الموسوعة الحرة\n\n\n معمارية وبنية زاحف الشبكة (Web crawler)\nزاحف الشبكة أو زاحف الويب (بالإنجليزية: Web crawler)‏ هو برنامج كمبيوتر يقوم بتصفح الشبكة العالمية بطريقة منهجية وآلية ومنظمة. هناك مصطلحات أخرى لزواحف الشبكة مثل النمل والمفهرس التلقائي، والبوت.[1]، وعناكب الشبكة [2]، أو آليات الشبكة.[2] وهذه العملية تسمى الزحف على الشبكة أو العنكبة.\nكثير من المواقع، وبخاصة محركات البحث، تستخدم العنكبة كوسيلة لتوفير بيانات حديثة. وزواحف الشبكة تستخدم أساسا لإنشاء نسخ من جميع الصفحات التي يتم زيارتها لكى يفهرسها محرك البحث في وقت لاحق ويحمل الصفحات أثناء عمليات البحث بسرعة. ويمكن أيضا أن تستخدم الزواحف لاتمام مهام الصيانة على موقع علي الشبكة، مثل التحقق من صحة الروابط أو تعليمات لغة تحرير النص الفائق البرمجية. أيضا، يمكن استخدام الزواحف لجمع أنواع محددة من المعلومات من صفحات الشبكة، مثل حصاد عناوين البريد الإلكتروني (عادة لارسال رسائل غير المرغوب فيها).\nوزاحف الشبكة هو أحد أنواع البوتات، أو وكلاء البرامج. بشكل عام، يبدأ زاحف الشبكة بقائمة من العناوين المرغوب في زيارتها، وتدعى هذه القائمة بالبذور. عندما يزور الزاحف هذه العناوين، فإنه يحدد كافة الارتباطات التشعبية في الصفحة ويضيفها إلى قائمة العناوين المطلوب زيارتها، وتدعى حدود الزحف. وتتم زيارة عناوين حدود الزحف بشكل متكرر وفقا لمجموعة من السياسات.\nبسبب الحجم الكبير يمكن للزاحف تحميل جزء صغير فقط من صفحات الشبكة في غضون فترة زمنية معينة، لذلك يحتاج إلى إعطاء الأولوية في التنزيلات. ومعدل التغييرالمرتفع يعني أن بعض الصفحات قد يكون تم تحديثه أو حتى حذفها.\nو عدد العناوين القابلة للزحف والتي تتولد من جانب البرمجيات الخادمة للمواقع على الشبكة جعلت من الصعب تجنب استرجاع محتويات مكرره أثناء الزحف على شبكة الإنترنت. يوجد تركيبات لانهائية من العناوين القائمة على أساس بروتوكول نقل النص الفائق، ولكن في الحقيقة لا يوجد سوى مجموعة صغيرة منها تعيد محتوى فريد. على سبيل المثال، قد يقدم عارض مبسط الصور على الإنترنت ثلاثة خيارات للمستخدمين، على النحو المحدد من خلال معلمات بروتوكول نقل النص الفائق في العنوان. إذا كان هناك أربع طرق لفرز الصور، وثلاثة خيارات لحجم الصورة المصغرة، وطرقتين لتنسيق الملفات، بالإضافة إلى خيار لتعطيل المحتوى القادم من المستخدم، فنفس المجموعة من محتوى يمكن الوصول إليها من خلال 48 عناوين مختلفة، كل منها على الموقع. هذا التوافق الرياضي يخلق مشكلة للزواحف، لأنها يجب أن تفرز من خلال تركيبات لا تنتهي من تغييرات طفيفة نسبيا في لغة البرمجة من أجل استرداد محتوى فريد من نوعه. ويجب أن يختار الزاحف بعناية في كل خطوة الصفحات التي تلي في الزيارة.\n\n\nسلوك زاحف الشبكة[عدل]\nسلوك زاحف الشبكة هو نتيجة لمزيج من السياسات:[3]\n\nسياسة الاختيار التي تحدد الصفحات التي ينبغى تحميلها.\nسياسة إعادة الزيارة التي تحدد متى يجب التحقق من التغييرات التي طرأت على الصفحات.\nسياسة الادب التي تنص على كيفية تجنب إثقال الموقع والمزار.\nسياسة الموازاة التي تنص كيفية تنسيق الزواحف الموزعة على الشبكة.\nسياسة الانتقاء[عدل]\nبالنظر إلى الحجم الحالي للشبكة، حتى محركات البحث الكبرى لا تستطيع سوى تغطية جزء مما متاح للجمهور. وأظهرت دراسة أجريت عام 2005 ان محركات البحث الكبرى لا تفهرس أكثر من 40 ٪ -70 ٪ من الشبكة المتاحة[4]؛ ودراسة سابقة أجراها الدكتور ستيف لورانس وجايلز لي أظهرت أنه لم يوجد محرك البحث قادر على فهرسة أكثر من 16 ٪ من شبكة الإنترنت في عام 1999.[5] بما ان تنزيلات الزاحف دائما مجرد جزء صغير من صفحات الشبكة، فمن المرغوب فيه جدا أن الجزء المحمل يحتوي على معظم الصفحات ذات الاهمية، وليس مجرد عينة عشوائية من الشبكة.\nهذا يتطلب مجدول من الثوابت لتحديد أولويات الصفحات على الشبكة. أهمية الصفحة تنبع من جودتها الذاتية، ومدى شعبيتها من حيث الوصلات أو الزيارات، وحتى من عنوانها (وهذا الثابت الأخير هو الحال في محركات البحث العمودى التي تقتصر على المستوى الأعلى من موقع، أو محركات البحث المقصورة على موقع ثابت). وهناك صعوبة اضافية في تصميم سياسة انتقاء جيدة: وهي انها يجب أن تتعامل مع معلومات جزئية، فأثناء الزحف لا تعرف المجموعة الكاملة من صفحات الشبكة مسبقا.\nقام تشو وآخرون بأول دراسة حول السياسات المتعلقة بجدولة الزحف. مجموعة بياناتهم كان زحف على 180000 صفحة من موقع stanford.edu، وتم محاكاة الزحف باستراتيجيات مختلفة.[6] كانت جداول الترتيب التي اختبرت هي الاتساع اولا، وعدد الصلات العائدة، وحسابات ترتيب الصفحة الجزئي. كان واحدا من الاستنتاجات ان الزاحف إذا اراد تحميل الصفحات ذات الرتبة العالية في وقت مبكر خلال عملية الزحف فإن سياسة رتبة الصفحة الجزئي هي الأفضل، وتليها إستراتيجية الاتساع أولا، ثم عدد الصلات العائدة. ومع ذلك، فإن هذه النتائج هي لموقع واحد فقط.\nنفذ ناجورك ووينر عملية زحف فعلي على 328 مليون صفحة مستخدمين سياسة الاتساع أولا.[7] ووجدوا أن الزحف بسياسة الاتساع أولا يلتقط الصفحات ذات رتبة الصفحة العالية في وقت مبكر من الزحف (لكنهم لم يقارنوا هذه الاستراتيجية ضد استراتيجيات أخرى). التفسير الذي قدمه الباحثون لهذه النتيجة هو أن «أهم صفحات يصلها العديد من الروابط من مضيفين متعددين، وسيتم العثور على تلك الروابط في وقت مبكر، بغض النظر عن المضيف أو الصفحة التي ينشاء منها الزحف».\nصمم ابيطبول إستراتيجية زحف قائمة على خوارزمية تدعى OPIC (حساب أهمية الصفحة على الإنترنت، أو اوبيك).[8] في أوبيك، تعطى كل صفحة مبلغ أولي من «النقدية» التي يتم توزيعها بالتساوي بين الصفحات التي تشير إليها. وذلك مماثل لحساب رتبة الصفحة، ولكنه أسرع ويتم في خطوة واحدة فقط. والزاحف الذي يستعمل اوبيك ينزل أولا الصفحات في حدود الزحف التي لديها كمية أكبر من «النقد». وأجريت التجارب على رسومات بيانية اصطناعية كل منها يحتوى على 100,000 صفحة، ولكنها لم تقارن مع غيرها من الاستراتيجيات أو في الواقع على الإنترنت.\nبولدى وآخرون استخدموا محاكاة على مجموعة مصغرة من الشبكة تحتوى على 40 مليون صفحة تحت منطقة.it الخاصة بإيطاليا و 100 مليون صفحة من الزحف ويب باس، واختبروا إستراتيجية الاتساع اولا ضد العمق اولا مع تريب عشوائى واستراتيجية لديها كل المعلومات (كلية العلم). واستندت المقارنة على مدى جودة تقييم رتبة الصفحة المحسوبة على أساس زحف جزئي مقاربة رتبة الصفحة الحقيقية. من المستغرب، ان بعض الزيارات التي تراكم رتبة الصفحة بسرعة كبيرة (وأبرزها، الاتساع اولا، وكلية العلم) تقدم تقديرات تقريبية تدريجية سيئة للغاية.[9][10] بايز ييتس وآخرون استخدموا محاكاة على اثنين من المجموعات المصغرة من الشبكة مكونة من 3 ملايين صفحة من اليونان وشيلى، واختبروا عليها استراتيجيات زحف عدة.[11] وأظهروا أن كلا من إستراتيجية اوبيك والاستراتيجية التي تستخدم طول قوائم الانتظار على الموقع هما أفضل من إستراتيجية الاتساع اولا، وأن استخدام أي زحف سابق أيضا فعال جدا، عندما يكون متوفرا، لتوجيه الزحف الحالي.\nدانيشباجوه وآخرون صمموا خوارزمية لاكتشاف بذور جيدة.[12] طريقتهم تزحف على صفحات الشبكة ذات الرتبة العالية من مجتمعات مختلفة بتكرار أقل بالمقارنة مع بدء الزحف من بذور عشوائية. يمكن للمرء استخراج بذور جيدة من رسم بياني لشبكة تم زحفها مسبقا باستخدام هذا الأسلوب الجديد. وباستخدام هذه البذور سيكون الزحف الجديد فعالا جدا.\n\nالمصادر[عدل]\n\n\n^ Kobayashi, M. and Takeda, K. (2000). \"Information retrieval on the web\". ACM Computing Surveys. ACM Press. ج. 32 ع. 2: 144–173. doi:10.1145/358923.358934. مؤرشف من الأصل في 2020-03-28.{{استشهاد بدورية محكمة}}:  صيانة CS1: أسماء متعددة: قائمة المؤلفين (link)\n\n↑ أ ب Spetka، Scott. \"The TkWWW Robot: Beyond Browsing\". المركز الوطني لتطبيقات الحوسبة الفائقة. مؤرشف من الأصل في 2004-09-03. اطلع عليه بتاريخ 2010-11-21.\n\n^ Castillo، Carlos (2004). Effective Web Crawling (Ph.D. thesis). University of Chile. مؤرشف من الأصل في 2019-12-11. اطلع عليه بتاريخ 2010-08-03. {{استشهاد بأطروحة}}: الوسيط |مؤلف= و|الأخير= تكرر أكثر من مرة (مساعدة)\n\n^ Gulli, A. (2005). \"The indexable web is more than 11.5 billion pages\". Special interest tracks and posters of the 14th international conference on World Wide Web. ACM Press. ص. 902–903. doi:10.1145/1062745.1062789. مؤرشف من الأصل في 2020-03-28. {{استشهاد بمنشورات مؤتمر}}: الوسيط author-name-list parameters تكرر أكثر من مرة (مساعدة)\n\n^ Lawrence، Steve (8 يوليو 1999). \"Accessibility of information on the web\". Nature. ج. 400 ع. 6740: 107. doi:10.1038/21987. PMID 10428673. {{استشهاد بدورية محكمة}}: الوسيط |تاريخ الوصول بحاجة لـ |مسار= (مساعدة) والوسيط author-name-list parameters تكرر أكثر من مرة (مساعدة)\n\n^ Cho, J.; Garcia-Molina, H.; Page, L. (1998-04). \"Seventh International World-Wide Web Conference\". Brisbane, Australia. اطلع عليه بتاريخ 2009-03-23. {{استشهاد بدورية محكمة}}: الاستشهاد بدورية محكمة يطلب |دورية محكمة= (مساعدة)، تحقق من التاريخ في: |تاريخ= (مساعدة)، والوسيط |الفصل= تم تجاهله (مساعدة)صيانة CS1: أسماء متعددة: قائمة المؤلفين (link)\n\n^ Marc Najork and Janet L. Wiener. Breadth-first crawling yields high-quality pages. In Proceedings of the Tenth Conference on World Wide Web, pages 114–118, Hong Kong, May 2001. Elsevier Science. نسخة محفوظة 24 ديسمبر 2017 على موقع واي باك مشين.\n\n^ Abiteboul، Serge (2003). \"Adaptive on-line page importance computation\". Proceedings of the 12th international conference on World Wide Web. Budapest, Hungary: ACM. ص. 280–290. doi:10.1145/775152.775192. ISBN 1-58113-680-3. مؤرشف من الأصل في 2018-08-14. اطلع عليه بتاريخ 2009-03-22. {{استشهاد بمنشورات مؤتمر}}: الوسيط author-name-list parameters تكرر أكثر من مرة (مساعدة)\n\n^ Boldi، Paolo (2004). \"UbiCrawler: a scalable fully distributed Web crawler\" (PDF). Software: Practice and Experience. ج. 34 ع. 8: 711–726. doi:10.1002/spe.587. مؤرشف من الأصل (PDF) في 2012-12-21. اطلع عليه بتاريخ 2009-03-23. {{استشهاد بدورية محكمة}}: الوسيط author-name-list parameters تكرر أكثر من مرة (مساعدة)\n\n^ Boldi، Paolo (2004). \"Do Your Worst to Make the Best: Paradoxical Effects in PageRank Incremental Computations\". Algorithms and Models for the Web-Graph. ص. 168–180. مؤرشف من الأصل (PDF) في 2010-04-19. اطلع عليه بتاريخ 2009-03-23. {{استشهاد بكتاب}}: الوسيط author-name-list parameters تكرر أكثر من مرة (مساعدة)\n\n^ Baeza-Yates, R., Castillo, C., Marin, M. and Rodriguez, A. (2005). Crawling a Country: Better Strategies than Breadth-First for Web Page Ordering. In Proceedings of the Industrial and Practical Experience track of the 14th conference on World Wide Web, pages 864–872, Chiba, Japan. ACM Press. نسخة محفوظة 8 يوليو 2020 على موقع واي باك مشين.\n\n^ Shervin Daneshpajouh, Mojtaba Mohammadi Nasiri, Mohammad Ghodsi, A Fast Community Based Algorithm for Generating Crawler Seeds Set نسخة محفوظة 20 يوليو 2011 على موقع واي باك مشين., In proceeding of 4th International Conference on Web Information Systems and Technologies (WEBIST-2008), Funchal, Portugal, May 2008. نسخة محفوظة 04 يوليو 2018 على موقع واي باك مشين.\n\n\nانظر أيضًا[عدل]\nحوسبة سحابية\nسلسلة إمداد\nاستخبارات تسويقية\n80 ليجز\n\nبوابة إنترنت\nبوابة تقانة المعلومات\nبوابة علم الحاسوب\nضبط استنادي: وطنية \nألمانيا\n\nمجلوبة من «https://ar.wikipedia.org/w/index.php?title=زاحف_الشبكة&oldid=61546878»\nتصنيفان: برمجيات محركات بحثزواحف ويبتصنيفات مخفية: صيانة CS1: أسماء متعددة: قائمة المؤلفينصفحات تحتوي مراجع بوسائط زائدةصفحات تحتوي مراجع ويب بتاريخ وصول وبدون رابط تشعبيأخطاء CS1: دورية مفقودةأخطاء CS1: التاريخأخطاء CS1: الفصل تم تجاهلهCS1: abbreviated year rangeقالب أرشيف الإنترنت بوصلات واي باكمقالات تحتوي نصا بالإنجليزيةبوابة إنترنت/مقالات متعلقةبوابة تقانة المعلومات/مقالات متعلقةبوابة علم الحاسوب/مقالات متعلقةجميع المقالات التي تستخدم شريط بواباتمقالات فيها معرفات GND\n\n\n\n\n\n\n آخر تعديل لهذه الصفحة كان يوم 14 مارس 2023، الساعة 07:14.\nالنصوص منشورة برخصة المشاع الإبداعي. طالع شروط الاستخدام للتفاصيل.\n\n\nسياسة الخصوصية\nحول ويكيبيديا\nإخلاء مسؤولية\nنسخة للأجهزة المحمولة\nالمطورون\nإحصائيات\nبيان تعريف الارتباطات\n\n\n\n\n\n\n\n\n\n\n", "keyword_freq": {"spider": 0}}]